In [164]:
import pandas as pd
import numpy as np
import datetime

In [73]:
df = pd.read_csv("sample.csv", index_col=0, parse_dates=True)

In [72]:
df1 = df.resample("D").mean()
df1["E"] = df["C"].resample("D").max()

In [74]:
# df1.index = pd.to_datetime(df1.index).strftime('%d-%m-%Y')
df1.index
df1

                             B     C     E
date
2022-06-01 00:00:00+09:00  1.5   3.0   4.0
2022-06-02 00:00:00+09:00  3.0   3.0   3.0
2022-06-03 00:00:00+09:00  3.0   5.0   5.0
2022-06-04 00:00:00+09:00  4.0  10.5  11.0
2022-06-05 00:00:00+09:00  4.0   3.0   3.0

In [84]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.490187 -0.194253  0.438193 -0.717401
2013-01-02  0.446959 -0.117948  1.445112  0.690237
2013-01-03 -1.073224 -0.158470  0.531445 -0.180895
2013-01-04 -0.363613 -1.345367 -0.188210 -0.853545
2013-01-05 -1.118169 -1.266916 -0.437245 -1.444461
2013-01-06  0.422449 -0.382481  0.904898  0.288519

In [91]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

Timestamp('2013-01-01 00:00:00', freq='D')

In [98]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df.groupby(["A", "B"]).max()

                  C         D
A   B
bar one   -0.060509  0.776057
    three  1.261814 -0.952233
    two    0.186416  0.498502
foo one   -0.030337  0.530867
    three  1.587044 -0.643522
    two    1.018996  2.056628

In [109]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
stacked = df.stack()
stacked.unstack()

                     A         B
first second
bar   one     0.446788  0.508982
      two     1.272230  0.779421
baz   one    -1.418948  1.006115
      two    -0.678372  1.747625
foo   one     0.601878  1.275719
      two     0.323071 -0.301284
qux   one     0.105508 -1.060480
      two    -0.281837 -0.391110

In [113]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -1.827614  0.282387
      B  1.553779  0.678457
      C -0.960794 -0.946865
three A  0.092318       NaN
      B       NaN -0.068262
      C -0.858932       NaN
two   A       NaN  0.609065
      B -0.723282       NaN
      C       NaN  0.152290

In [118]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample("5Min").sum()

2012-01-01    22891
Freq: 5T, dtype: int64

In [126]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
ts_utc = ts.tz_localize("US/Eastern")
ts_utc

2012-03-06 00:00:00-05:00   -2.122021
2012-03-07 00:00:00-05:00   -0.602342
2012-03-08 00:00:00-05:00   -0.049000
2012-03-09 00:00:00-05:00    0.792433
2012-03-10 00:00:00-05:00   -0.479497
dtype: float64

In [136]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ps = ts.to_period()
ps = ts.to_period()
ps.to_timestamp()

2012-01-01   -0.621869
2012-02-01    1.842128
2012-03-01   -0.832930
2012-04-01   -2.059562
2012-05-01    0.030319
Freq: MS, dtype: float64

In [146]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)
df["grade"] = df["raw_grade"].astype("category")
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [152]:
df = pd.DataFrame({'col1': list('ABBC'), 'col2': list('ZZXY')})
df["color"] = np.where(df["col2"] == "Z", "green", "red")
conditions = [
    (df['col2'] == 'Z') & (df['col1'] == 'A'),
    (df['col2'] == 'Z') & (df['col1'] == 'B'),
    (df['col1'] == 'B')
]
choices = ["yellow", "blue", "purple"]
df["color"] = np.select(conditions, choices, default="black")
df

  col1 col2   color
0    A    Z  yellow
1    B    Z    blue
2    B    X  purple
3    C    Y   black

In [155]:
n = 10
df = pd.DataFrame(np.random.rand(n, 3), columns=list("abc"))
df[(df["a"] < df["b"]) & (df["b"] < df["c"])]
df.query("(a < b) & (b < c)")

          a         b         c
0  0.183877  0.240237  0.300672
2  0.073428  0.741005  0.775150
9  0.287599  0.343724  0.679025

In [156]:
df = pd.DataFrame(np.random.rand(n, 3), columns=list("abc"))
df2 = pd.DataFrame(np.random.rand(n + 2, 3), columns=df.columns)
expr = "0.0 <= a <= c <= 0.5"
map(lambda frame: frame.query(expr), [df, df2])

In [158]:
df = pd.read_csv("sample.csv", index_col=0, parse_dates=[0])
df

                                A  B     C
date
2022-06-01 08:00:00+09:00   apple  1   2.0
2022-06-01 08:00:00+09:00   apple  2   4.0
2022-06-02 09:00:00+09:00   grape  2   3.0
2022-06-02 09:00:00+09:00   grape  4   3.0
2022-06-03 10:00:00+09:00  banana  3   5.0
2022-06-03 10:00:00+09:00  banana  3   NaN
2022-06-04 11:00:00+09:00   remon  4  10.0
2022-06-04 11:00:00+09:00     NaN  4  11.0
2022-06-05 12:00:00+09:00    kiwi  4   3.0
2022-06-05 12:00:00+09:00    kiwi  4   3.0

In [172]:
start = datetime.datetime(2011, 1, 1)
end = datetime.datetime(2012, 1, 1)
rng = pd.date_range(start, end, freq="BM")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts.index

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-29',
               '2011-05-31', '2011-06-30', '2011-07-29', '2011-08-31',
               '2011-09-30', '2011-10-31', '2011-11-30', '2011-12-30'],
              dtype='datetime64[ns]', freq='BM')

In [178]:
dft = pd.DataFrame(
    np.random.randn(100000, 1),
    columns=["A"],
    index=pd.date_range("20130101", periods=100000, freq="T"),
)
dft[datetime.datetime(2013, 1, 1): datetime.datetime(2013, 2, 28)]

                            A
2013-01-01 00:00:00 -1.303730
2013-01-01 00:01:00 -0.514631
2013-01-01 00:02:00  0.574368
2013-01-01 00:03:00 -1.166204
2013-01-01 00:04:00  0.690123
...                       ...
2013-02-27 23:56:00 -0.284981
2013-02-27 23:57:00 -0.066330
2013-02-27 23:58:00 -1.824580
2013-02-27 23:59:00 -2.012263
2013-02-28 00:00:00 -1.369988

[83521 rows x 1 columns]

In [234]:
df = pd.read_csv("sample.csv", parse_dates=[0])
df1 = df[df["date"] > "2022-6-2 10:00:00"]
df1 = df1[df1["C"].notna()]
df1

                       date       A  B     C
4 2022-06-03 10:00:00+09:00  banana  3   5.0
6 2022-06-04 11:00:00+09:00   remon  4  10.0
7 2022-06-04 11:00:00+09:00   remon  4  11.0
8 2022-06-05 12:00:00+09:00    kiwi  4   3.0
9 2022-06-05 12:00:00+09:00    kiwi  4   3.0

In [239]:
df.loc[:, "C"].notna()

0     True
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8     True
9     True
Name: C, dtype: bool